{
  "810": {
    "code": "810",
    "name": "X12",
    "description": "This standard provides the format and establishes the data contents of an invoice transaction set. The invoice transaction set provides for customary and established business and industry practice relative to the billing for goods and services provided."
  },
  "819": {
    "code": "819",
    "name": "X12",
    "description": "This standard provides the format and establishes the data contents of an operating expense statement transaction set. The operating expense statement transaction set can be used to transmit periodic expense details from the operator of an asset to the various owners of that asset (e.g., the operation of a petroleum lease or property having multiple owners)."
  },
  "820": {
    "code": "820",
    "name": "X12",
    "description": "This standard provides the format and establishes the data contents of a payment order/remittance advice transaction set. The payment order/remittance advice transaction set can be used for three different purposes: (1) to order a financial institution to make payment to payee(s) on behalf of the sending party, (2) to report the completion of a payment to payee(s) by a financial institution, and (3) to give advice to the payee by the payor on the application of a payment made with the payment order or by some other means. This standard is not designed for exception reporting from the financial institution to either party."
  },
  "821": {
    "code": "821",
    "name": "X12",
    "description": "This standard provides the format and establishes the data contents of the financial information reporting transaction set. This transaction set can be used to report balances, detail and summary financial transactions, and other related account information. It can be used by financial institutions and their agents to report to their clients."
  },
  "822": {
    "code": "822",
    "name": "X12",
    "description": "This standard provides the format and establishes the data contents of a customer account analysis transaction set. The customer account analysis transaction set is used to transmit detailed balance, service charge and adjustment detail primarily from a bank to its corporate clients. However, this transaction set can also be used between or within corporations."
  },
  "823": {
    "code": "823",
    "name": "X12",
    "description": "This standard provides the format and establishes the data contents of a lockbox transaction set. The lockbox transaction set can be used to transmit lockbox (incoming payments) information and totals from a bank or any other lockbox service provider to a company."
  },
  "830": {
    "code": "830",
    "name": "X12",
    "description": "This standard provides the format and establishes the data contents of a planning schedule with release capability transaction set. The planning schedule with release capability transaction set provides for customary and established business practice relative to the transfer of forecasting/material release information between organizations.  The planning schedule transaction may be used in various ways or in a combination of ways, such as: (1) a simple forecast; (2) a forecast with the buyer's authorization for the seller to commit to resources, such as labor or material; (3) a forecast that is also used as an order release mechanism, containing such elements as resource authorizations, period-to-date cumulative quantities, and specific ship/delivery patterns for requirements that have been represented in ``buckets,'' such as weekly, monthly, or quarterly. The order release forecast may also contain all data related to purchase orders, as required, because the order release capability eliminates the need for discrete generation of purchase orders."
  },
  "832": {
    "code": "832",
    "name": "X12",
    "description": "This standard provides the format and establishes the data contents of a price/sales catalog transaction set. The price/sales catalog transaction set provides for customary and established business and industry practice relative to the furnishing of the price of goods or services in the form of a catalog to potential buyers."
  },
  "840": {
    "code": "840",
    "name": "X12",
    "description": "This standard provides the format and establishes the data contents of a request for quotation transaction set. The request for quotation transaction set provides potential buyers with the ability to solicit price, delivery schedule, and other items from potential sellers of goods and services."
  },
  "843": {
    "code": "843",
    "name": "X12",
    "description": "This standard provides the format and establishes the data contents of a response to request for quotation transaction set.The response to request for quotation transaction set provides potential buyers with price, delivery schedule, and other terms from potential sellers of goods and services, in response to a request for such information."
  },
  "844": {
    "code": "844",
    "name": "X12",
    "description": "This standard provides the format and establishes the data contents of a product transfer account adjustment transaction set. This transaction set can be used to transmit specific data in the form of a debit, credit, or request for credit relating to pre-authorized product transfer actions."
  },
  "845": {
    "code": "845",
    "name": "X12",
    "description": "This standard provides the format and establishes the data content of a price authorization acknowledgment/status transaction set. The price authorization acknowledgment/status transaction set is used by a vendor or manufacturer to transmit specific data relative to the status of or changes to outstanding price authorizations."
  },
  "846": {
    "code": "846",
    "name": "X12",
    "description": "The purpose of this transaction set is to transmit the contents of an inventory inquiry/advice transaction set within the context of an electronic data interchange environment. The inventory inquiry/advice transaction set may be used in the following ways: (1) for a seller of goods and services to provide inventory information to a prospective purchaser, with no obligation to the purchaser to acquire these goods or services; (2) for a representative of a seller of goods and services to supply inventory information to that seller; (3) for one location to supply another location with inventory information; and (4) for an inquiry as to the availability of inventory with no obligation on the seller of goods and services to reserve that inventory. (DM # 229-388)"
  },
  "849": {
    "code": "849",
    "name": "X12",
    "description": "This standard provides the format and establishes the data contents of the response to product transfer account adjustment transaction set. This transaction set can be used to transmit a detailed or summary response to a party requesting an accounting adjustment relating to a pre-authorized product transfer."
  },
  "850": {
    "code": "850",
    "name": "X12",
    "description": "This standard provides the format and establishes the data contents of a purchase order transaction set. The purchase order transaction set provides for customary and established business and industry practice relative to the placement of purchase orders for goods and services. This transaction set should not be used to convey purchase order changes or purchase order acknowledgment information."
  },
  "855": {
    "code": "855",
    "name": "X12",
    "description": "This standard provides the format and establishes the data contents of a purchase order acknowledgment transaction set. The purchase order acknowledgment transaction set provides for customary and established business and industry practice relative to a seller's acknowledgment of a buyer's purchase order."
  },
  "856": {
    "code": "856",
    "name": "X12",
    "description": "This standard provides the standardized format and establishes the data contents of a ship notice/manifest transaction set. A ship notice/manifest lists the contents of a shipment of goods as well as additional information relating to the shipment, such as order information, product description, physical characteristics, type of packaging, marking, carrier information, and configuration of goods within the transportation equipment. The transaction set enables the sender to describe the contents and configuration of a shipment in various levels of detail and provides an ordered flexibility to convey information.  The sender of this transaction is the organization responsible for detailing and communicating the contents of a shipment, or shipments, to one or more receivers of the transaction set. The receiver of this transaction set can be any organization having an interest in the contents of a shipment or information about the contents of a shipment."
  },
  "858": {
    "code": "858",
    "name": "X12",
    "description": "This standard provides the format and establishes the data contents of a shipment information transaction set. The shipment information transaction set provides the sender with the capability to transmit detailed bill-of-lading, rating, and/or scheduling information pertinent to a shipment."
  },
  "860": {
    "code": "860",
    "name": "X12",
    "description": "This standard provides for the format and establishes the data contents of a purchase order change transaction set. The purchase order change transaction set provides the information required for the customary and established business and industry practice relative to a purchase order change. This transaction can be used: (1) by a buyer to request a change to a previously submitted purchase order or (2) by a buyer to confirm acceptance of a purchase order change initiated by the seller or by mutual agreement of the two parties. (DM Number 672)"
  },
  "861": {
    "code": "861",
    "name": "X12",
    "description": "This standard provides the format and establishes the data contents of a receiving advice transaction set. The receiving advice transaction set provides for customary and established business and industry practice relative to the notification of receipt of goods and services."
  },
  "862": {
    "code": "862",
    "name": "X12",
    "description": "This standard provides the format and establishes the data contents of a shipping schedule transaction set within the context of an electronic data interchange (EDI) environment. The shipping schedule transaction set provides the ability for a customer to convey precise shipping schedule requirements to a supplier, and is intended to supplement the planning schedule transaction set (830). The shipping schedule transaction set will supersede certain shipping and delivery information transmitted in a previous planning schedule transaction, but it does not replace the 830 transaction set. The shipping schedule transaction set shall not be used to authorize labor, materials or other resources.  The use of this transaction set will facilitate the practice of Just-In-Time (JIT) manufacturing by providing the customer with a mechanism to issue precise shipping schedule requirements on a more frequent basis than with the issuance of a planning schedule transaction, e.g. daily shipping schedules versus weekly planning schedules. The shipping schedule transaction also provides the ability for a customer location to issue shipping requirements independent of other customer locations when planning schedule transactions are issued by a consolidated scheduling organization."
  },
  "863": {
    "code": "863",
    "name": "X12",
    "description": "This standard provides the format and establishes the data contents of a report of test results transaction set. This transaction set can be used to transmit the results of tests performed to satisfy a specified product or process requirement. This includes, but is not limited to, test data such as inspection data, certification data, and statistical process control measurements."
  },
  "864": {
    "code": "864",
    "name": "X12",
    "description": "This standard provides the format and establishes the data contents of a text transaction set. The text transaction set provides users with a capability to electronically move messages, contracts, explanations and other one-time communications. It is the intent of this transaction set to provide electronic communication (messages) for people, not for computer processing. The use of the transaction set to transmit quasi or unique transaction set standards is discouraged.  The use of the text transaction set demands of the sender certain detailed information about the recipient. The transaction set's purpose is to provide communication to the recipient in some human-readable form. The recipient's network will dictate what capabilities are available for delivery of the information. It is the responsibility of the sender to obtain this information and include it in the transmission."
  },
  "865": {
    "code": "865",
    "name": "X12",
    "description": "This standard provides for the format and establishes the data contents of a purchase order change acknowledgment transaction set. This transaction set can be used: (1) by the seller to acknowledge or convey acceptance of changes to a previously submitted purchase order or (2) by a seller to notify the buyer of changes initiated by the seller to a previously submitted purchase order."
  },
  "867": {
    "code": "867",
    "name": "X12",
    "description": "This standard provides the format and establishes the to transmit the data contents of a product transfer and resale report transaction set. The product transfer and resale report transaction set may be used in the following ways: (1) to report information about product that has been transferred from one location to another; (2) to report sales of product from one or more locations to an end customer; or (3) to report sales of a product from one or more locations to an end customer, and demand beyond actual sales (lost orders)."
  },
  "869": {
    "code": "869",
    "name": "X12",
    "description": "This standard provides the format and establishes the data contents of an order status inquiry transaction set. The order status inquiry transaction set provides the ability to request all pertinent information relative to an entire purchase order, selected line items on a purchase order, or selected products/services on a purchase order. Inquiry can also be made for all or a selected portion of the customer's ordered items, all or a selected portion of the customer's unshipped items, or all or a selected portion of the customer's shipped items."
  },
  "870": {
    "code": "870",
    "name": "X12",
    "description": "This standard provides the format and establishes the data contents of an order status report transaction set. The order status report transaction set provides the ability to report on the current status of an entire purchase order, selected line items on a purchase order, selected products/services on a purchase order, or purchase orders for a specific customer in their entirety or on a selection basis. The report format allows for the inclusion of ``reasons'' relative to the status of the purchase order(s). This transaction set may also be used to update the supplier's scheduled shipment or delivery date(s). This transaction set can result from either an inquiry (via the Order Status Inquiry Transaction Set [869]) or a prearranged schedule agreed to by the trading partners."
  },
  "940": {
    "code": "940",
    "name": "X12",
    "description": "This standard provides the format and establishes the data contents of the warehouse shipping order transaction set. This transaction set is used to enable the depositor to advise the warehouse to make a shipment."
  },
  "997": {
    "code": "997",
    "name": "X12",
    "description": "This standard provides the format and establishes the data contents of a functional acknowledgment transaction set. The purpose of this standard is to define the control structures for a set of acknowledgments to indicate the results of the syntactical analysis of the electronically encoded documents. The encoded documents are the transaction sets, which are grouped in functional groups, used in defining transactions for business data interchange. This standard does not cover the semantic meaning of the information encoded in the transaction sets."
  }
}